Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS504.h
/* ADCON2 */
#define _EIE ADCON2bits.EIE
#define _STRGSRC ADCON2bits.STRGSRC
#define _FLTRDLY ADCON2bits.FLTRDLY
#define _EIE0 ADCON2bits.EIE0
#define _EIE1 ADCON2bits.EIE1
#define _EIE2 ADCON2bits.EIE2
#define _STRGSRC0 ADCON2bits.STRGSRC0
#define _STRGSRC1 ADCON2bits.STRGSRC1
#define _STRGSRC2 ADCON2bits.STRGSRC2
#define _STRGSRC3 ADCON2bits.STRGSRC3
#define _STRGSRC4 ADCON2bits.STRGSRC4
#define _FLTRDLY0 ADCON2bits.FLTRDLY0
#define _FLTRDLY1 ADCON2bits.FLTRDLY1
#define _FLTRDLY2 ADCON2bits.FLTRDLY2
#define _FLTRDLY3 ADCON2bits.FLTRDLY3
#define _FLTRDLY4 ADCON2bits.FLTRDLY4

/* ADCON3 */
#define _ADCS ADCON3bits.ADCS
#define _ADCSEL ADCON3bits.ADCSEL
#define _LOWPWR ADCON3bits.LOWPWR
#define _BOOST ADCON3bits.BOOST
#define _ADCS0 ADCON3bits.ADCS0
#define _ADCS1 ADCON3bits.ADCS1
#define _ADCS2 ADCON3bits.ADCS2
#define _ADCS3 ADCON3bits.ADCS3
#define _ADCS4 ADCON3bits.ADCS4
#define _ADCS5 ADCON3bits.ADCS5
#define _ADCS6 ADCON3bits.ADCS6
#define _ADCSEL0 ADCON3bits.ADCSEL0
#define _ADCSEL1 ADCON3bits.ADCSEL1

/* ADCON4 */
#define _SAMC ADCON4bits.SAMC
#define _ADCRDY ADCON4bits.ADCRDY
#define _SAMC0 ADCON4bits.SAMC0
#define _SAMC1 ADCON4bits.SAMC1
#define _SAMC2 ADCON4bits.SAMC2
#define _SAMC3 ADCON4bits.SAMC3
#define _SAMC4 ADCON4bits.SAMC4
#define _SAMC5 ADCON4bits.SAMC5
#define _SAMC6 ADCON4bits.SAMC6
#define _SAMC7 ADCON4bits.SAMC7

/* ADCON5 */
#define _ADINSEL ADCON5bits.ADINSEL
#define _VREFSEL ADCON5bits.VREFSEL
#define _ADINSEL0 ADCON5bits.ADINSEL0
#define _ADINSEL1 ADCON5bits.ADINSEL1
#define _ADINSEL2 ADCON5bits.ADINSEL2
#define _ADINSEL3 ADCON5bits.ADINSEL3
#define _ADINSEL4 ADCON5bits.ADINSEL4
#define _ADINSEL5 ADCON5bits.ADINSEL5
#define _VREFSEL0 ADCON5bits.VREFSEL0
#define _VREFSEL1 ADCON5bits.VREFSEL1
#define _VREFSEL2 ADCON5bits.VREFSEL2

/* ADCON6 */
#define _RQCONVRT ADCON6bits.RQCONVRT
#define _GSWTRG ADCON6bits.GSWTRG
#define _CAL ADCON6bits.CAL

/* ADMOD */
#define _SH0MOD ADMODbits.SH0MOD
#define _SH1MOD ADMODbits.SH1MOD
#define _SH2MOD ADMODbits.SH2MOD
#define _SH3MOD ADMODbits.SH3MOD
#define _SH4MOD ADMODbits.SH4MOD
#define _SH0MOD0 ADMODbits.SH0MOD0
#define _SH0MOD1 ADMODbits.SH0MOD1
#define _SH1MOD0 ADMODbits.SH1MOD0
#define _SH1MOD1 ADMODbits.SH1MOD1
#define _SH2MOD0 ADMODbits.SH2MOD0
#define _SH2MOD1 ADMODbits.SH2MOD1
#define _SH3MOD0 ADMODbits.SH3MOD0
#define _SH3MOD1 ADMODbits.SH3MOD1
#define _SH4MOD0 ADMODbits.SH4MOD0
#define _SH4MOD1 ADMODbits.SH4MOD1

/* ADALT */
#define _SH0ALT ADALTbits.SH0ALT
#define _SH1ALT ADALTbits.SH1ALT
#define _SH2ALT ADALTbits.SH2ALT
#define _SH3ALT ADALTbits.SH3ALT
#define _SH0ALT0 ADALTbits.SH0ALT0
#define _SH0ALT1 ADALTbits.SH0ALT1
#define _SH1ALT0 ADALTbits.SH1ALT0
#define _SH1ALT1 ADALTbits.SH1ALT1
#define _SH2ALT0 ADALTbits.SH2ALT0
#define _SH2ALT1 ADALTbits.SH2ALT1
#define _SH3ALT0 ADALTbits.SH3ALT0
#define _SH3ALT1 ADALTbits.SH3ALT1

/* ADGIRQENL */
#define _IRQEN0 ADGIRQENLbits.IRQEN0
#define _IRQEN1 ADGIRQENLbits.IRQEN1
#define _IRQEN2 ADGIRQENLbits.IRQEN2
#define _IRQEN3 ADGIRQENLbits.IRQEN3
#define _IRQEN4 ADGIRQENLbits.IRQEN4
#define _IRQEN5 ADGIRQENLbits.IRQEN5
#define _IRQEN6 ADGIRQENLbits.IRQEN6
#define _IRQEN7 ADGIRQENLbits.IRQEN7
#define _IRQEN8 ADGIRQENLbits.IRQEN8
#define _IRQEN9 ADGIRQENLbits.IRQEN9
#define _IRQEN10 ADGIRQENLbits.IRQEN10
#define _IRQEN11 ADGIRQENLbits.IRQEN11
#define _IRQEN12 ADGIRQENLbits.IRQEN12
#define _IRQEN14 ADGIRQENLbits.IRQEN14

/* ADGIRQENH */
#define _IRQEN17 ADGIRQENHbits.IRQEN17
#define _IRQEN18 ADGIRQENHbits.IRQEN18
#define _IRQEN19 ADGIRQENHbits.IRQEN19
#define _IRQEN20 ADGIRQENHbits.IRQEN20
#define _IRQEN21 ADGIRQENHbits.IRQEN21
#define _IRQEN22 ADGIRQENHbits.IRQEN22
#define _IRQEN23 ADGIRQENHbits.IRQEN23
#define _IRQEN24 ADGIRQENHbits.IRQEN24
#define _IRQEN25 ADGIRQENHbits.IRQEN25
#define _IRQEN26 ADGIRQENHbits.IRQEN26

/* ADCSSL */
#define _CSS0 ADCSSLbits.CSS0
#define _CSS1 ADCSSLbits.CSS1
#define _CSS2 ADCSSLbits.CSS2
#define _CSS3 ADCSSLbits.CSS3
#define _CSS4 ADCSSLbits.CSS4
#define _CSS5 ADCSSLbits.CSS5
#define _CSS6 ADCSSLbits.CSS6
#define _CSS7 ADCSSLbits.CSS7
#define _CSS8 ADCSSLbits.CSS8
#define _CSS9 ADCSSLbits.CSS9
#define _CSS10 ADCSSLbits.CSS10
#define _CSS11 ADCSSLbits.CSS11
#define _CSS12 ADCSSLbits.CSS12
#define _CSS14 ADCSSLbits.CSS14

/* ADCSSH */
#define _CSS17 ADCSSHbits.CSS17
#define _CSS18 ADCSSHbits.CSS18
#define _CSS19 ADCSSHbits.CSS19
#define _CSS20 ADCSSHbits.CSS20
#define _CSS21 ADCSSHbits.CSS21
#define _CSS22 ADCSSHbits.CSS22
#define _CSS23 ADCSSHbits.CSS23
#define _CSS24 ADCSSHbits.CSS24
#define _CSS25 ADCSSHbits.CSS25
#define _CSS26 ADCSSHbits.CSS26

/* ADSTATL */
#define _AN0RDY ADSTATLbits.AN0RDY
#define _AN1RDY ADSTATLbits.AN1RDY
#define _AN2RDY ADSTATLbits.AN2RDY
#define _AN3RDY ADSTATLbits.AN3RDY
#define _AN4RDY ADSTATLbits.AN4RDY
#define _AN5RDY ADSTATLbits.AN5RDY
#define _AN6RDY ADSTATLbits.AN6RDY
#define _AN7RDY ADSTATLbits.AN7RDY
#define _AN8RDY ADSTATLbits.AN8RDY
#define _AN9RDY ADSTATLbits.AN9RDY
#define _AN10RDY ADSTATLbits.AN10RDY
#define _AN11RDY ADSTATLbits.AN11RDY
#define _AN12RDY ADSTATLbits.AN12RDY
#define _AN14RDY ADSTATLbits.AN14RDY

/* ADSTATH */
#define _AN17RDY ADSTATHbits.AN17RDY
#define _AN18RDY ADSTATHbits.AN18RDY
#define _AN19RDY ADSTATHbits.AN19RDY
#define _AN20RDY ADSTATHbits.AN20RDY
#define _AN21RDY ADSTATHbits.AN21RDY
#define _AN22RDY ADSTATHbits.AN22RDY
#define _AN23RDY ADSTATHbits.AN23RDY
#define _AN24RDY ADSTATHbits.AN24RDY
#define _AN25RDY ADSTATHbits.AN25RDY
#define _AN26RDY ADSTATHbits.AN26RDY

/* DCMP1ENL */
/* Bitname _CMPEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN1 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN2 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN3 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN4 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN5 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN6 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN7 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN8 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN9 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN10 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN11 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN12 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN14 cannot be defined because it is used by more than one SFR */

