Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS504.h
/* ADTRIG3 */
#define _TRGSRC4 ADTRIG3bits.TRGSRC4
#define _TRGSRC5 ADTRIG3bits.TRGSRC5
#define _TRGSRC40 ADTRIG3bits.TRGSRC40
#define _TRGSRC41 ADTRIG3bits.TRGSRC41
#define _TRGSRC42 ADTRIG3bits.TRGSRC42
#define _TRGSRC43 ADTRIG3bits.TRGSRC43
#define _TRGSRC44 ADTRIG3bits.TRGSRC44
#define _TRGSRC50 ADTRIG3bits.TRGSRC50
#define _TRGSRC51 ADTRIG3bits.TRGSRC51
#define _TRGSRC52 ADTRIG3bits.TRGSRC52
#define _TRGSRC53 ADTRIG3bits.TRGSRC53
#define _TRGSRC54 ADTRIG3bits.TRGSRC54

/* ADTRIG4 */
#define _TRGSRC6 ADTRIG4bits.TRGSRC6
#define _TRGSRC7 ADTRIG4bits.TRGSRC7
#define _TRGSRC60 ADTRIG4bits.TRGSRC60
#define _TRGSRC61 ADTRIG4bits.TRGSRC61
#define _TRGSRC62 ADTRIG4bits.TRGSRC62
#define _TRGSRC63 ADTRIG4bits.TRGSRC63
#define _TRGSRC64 ADTRIG4bits.TRGSRC64
#define _TRGSRC70 ADTRIG4bits.TRGSRC70
#define _TRGSRC71 ADTRIG4bits.TRGSRC71
#define _TRGSRC72 ADTRIG4bits.TRGSRC72
#define _TRGSRC73 ADTRIG4bits.TRGSRC73
#define _TRGSRC74 ADTRIG4bits.TRGSRC74

/* ADTRIG5 */
#define _TRGSRC8 ADTRIG5bits.TRGSRC8
#define _TRGSRC9 ADTRIG5bits.TRGSRC9
#define _TRGSRC80 ADTRIG5bits.TRGSRC80
#define _TRGSRC81 ADTRIG5bits.TRGSRC81
#define _TRGSRC82 ADTRIG5bits.TRGSRC82
#define _TRGSRC83 ADTRIG5bits.TRGSRC83
#define _TRGSRC84 ADTRIG5bits.TRGSRC84
#define _TRGSRC90 ADTRIG5bits.TRGSRC90
#define _TRGSRC91 ADTRIG5bits.TRGSRC91
#define _TRGSRC92 ADTRIG5bits.TRGSRC92
#define _TRIGSRC93 ADTRIG5bits.TRIGSRC93
#define _TRGSRC94 ADTRIG5bits.TRGSRC94

/* ADTRIG6 */
/* Bitname _TRGSRC10 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC11 cannot be defined because it is used by more than one SFR */
#define _TRGSRC100 ADTRIG6bits.TRGSRC100
#define _TRGSRC101 ADTRIG6bits.TRGSRC101
#define _TRGSRC102 ADTRIG6bits.TRGSRC102
#define _TRGSRC103 ADTRIG6bits.TRGSRC103
#define _TRGSRC104 ADTRIG6bits.TRGSRC104
#define _TRGSRC110 ADTRIG6bits.TRGSRC110
#define _TRGSRC111 ADTRIG6bits.TRGSRC111
#define _TRGSRC112 ADTRIG6bits.TRGSRC112
#define _TRGSRC113 ADTRIG6bits.TRGSRC113
#define _TRGSRC114 ADTRIG6bits.TRGSRC114

/* ADTRIG7 */
/* Bitname _TRGSRC12 cannot be defined because it is used by more than one SFR */
#define _TRGSRC120 ADTRIG7bits.TRGSRC120
#define _TRGSRC121 ADTRIG7bits.TRGSRC121
#define _TRGSRC122 ADTRIG7bits.TRGSRC122
#define _TRGSRC123 ADTRIG7bits.TRGSRC123
#define _TRGSRC124 ADTRIG7bits.TRGSRC124

/* ADTRIG8 */
/* Bitname _TRGSRC14 cannot be defined because it is used by more than one SFR */
#define _TRGSRC140 ADTRIG8bits.TRGSRC140
#define _TRGSRC141 ADTRIG8bits.TRGSRC141
#define _TRGSRC142 ADTRIG8bits.TRGSRC142
#define _TRGSRC143 ADTRIG8bits.TRGSRC143
#define _TRGSRC144 ADTRIG8bits.TRGSRC144

/* ADTRIG9 */
#define _TRGSRC17 ADTRIG9bits.TRGSRC17
#define _TRGSRC170 ADTRIG9bits.TRGSRC170
#define _TRGSRC171 ADTRIG9bits.TRGSRC171
#define _TRGSRC172 ADTRIG9bits.TRGSRC172
#define _TRGSRC173 ADTRIG9bits.TRGSRC173
#define _TRGSRC174 ADTRIG9bits.TRGSRC174

/* ADTRIG10 */
#define _TRGSRC18 ADTRIG10bits.TRGSRC18
#define _TRGSRC19 ADTRIG10bits.TRGSRC19
#define _TRGSRC180 ADTRIG10bits.TRGSRC180
#define _TRGSRC181 ADTRIG10bits.TRGSRC181
#define _TRGSRC182 ADTRIG10bits.TRGSRC182
#define _TRGSRC183 ADTRIG10bits.TRGSRC183
#define _TRGSRC184 ADTRIG10bits.TRGSRC184
#define _TRGSRC190 ADTRIG10bits.TRGSRC190
#define _TRGSRC191 ADTRIG10bits.TRGSRC191
#define _TRGSRC192 ADTRIG10bits.TRGSRC192
#define _TRGSRC193 ADTRIG10bits.TRGSRC193
#define _TRGSRC194 ADTRIG10bits.TRGSRC194

/* ADTRIG11 */
/* Bitname _TRGSRC20 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC21 cannot be defined because it is used by more than one SFR */
#define _TRGSRC200 ADTRIG11bits.TRGSRC200
#define _TRGSRC201 ADTRIG11bits.TRGSRC201
#define _TRGSRC202 ADTRIG11bits.TRGSRC202
#define _TRGSRC203 ADTRIG11bits.TRGSRC203
#define _TRGSRC204 ADTRIG11bits.TRGSRC204
#define _TRGSRC210 ADTRIG11bits.TRGSRC210
#define _TRGSRC211 ADTRIG11bits.TRGSRC211
#define _TRGSRC212 ADTRIG11bits.TRGSRC212
#define _TRGSRC213 ADTRIG11bits.TRGSRC213
#define _TRGSRC214 ADTRIG11bits.TRGSRC214

/* ADTRIG12 */
/* Bitname _TRGSRC22 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC23 cannot be defined because it is used by more than one SFR */
#define _TRGSRC220 ADTRIG12bits.TRGSRC220
#define _TRGSRC221 ADTRIG12bits.TRGSRC221
#define _TRGSRC222 ADTRIG12bits.TRGSRC222
#define _TRGSRC223 ADTRIG12bits.TRGSRC223
#define _TRGSRC224 ADTRIG12bits.TRGSRC224
#define _TRGSRC230 ADTRIG12bits.TRGSRC230
#define _TRGSRC231 ADTRIG12bits.TRGSRC231
#define _TRGSRC232 ADTRIG12bits.TRGSRC232
#define _TRGSRC233 ADTRIG12bits.TRGSRC233
#define _TRGSRC234 ADTRIG12bits.TRGSRC234

/* ADTRIG13 */
/* Bitname _TRGSRC24 cannot be defined because it is used by more than one SFR */
#define _TRGSRC25 ADTRIG13bits.TRGSRC25
#define _TRGSRC240 ADTRIG13bits.TRGSRC240
#define _TRGSRC241 ADTRIG13bits.TRGSRC241
#define _TRGSRC242 ADTRIG13bits.TRGSRC242
#define _TRGSRC243 ADTRIG13bits.TRGSRC243
#define _TRGSRC244 ADTRIG13bits.TRGSRC244
#define _TRGSRC250 ADTRIG13bits.TRGSRC250
#define _TRGSRC251 ADTRIG13bits.TRGSRC251
#define _TRGSRC252 ADTRIG13bits.TRGSRC252
#define _TRGSRC253 ADTRIG13bits.TRGSRC253
#define _TRGSRC254 ADTRIG13bits.TRGSRC254

/* ADTRIG14 */
#define _TRGSRC26 ADTRIG14bits.TRGSRC26
#define _TRGSRC260 ADTRIG14bits.TRGSRC260
#define _TRGSRC261 ADTRIG14bits.TRGSRC261
#define _TRGSRC262 ADTRIG14bits.TRGSRC262
#define _TRGSRC263 ADTRIG14bits.TRGSRC263
#define _TRGSRC264 ADTRIG14bits.TRGSRC264

/* DCMP1CON */
/* Bitname _IELOLO cannot be defined because it is used by more than one SFR */
/* Bitname _IELOHI cannot be defined because it is used by more than one SFR */
/* Bitname _IEHILO cannot be defined because it is used by more than one SFR */
/* Bitname _IEHIHI cannot be defined because it is used by more than one SFR */
/* Bitname _IEBTWN cannot be defined because it is used by more than one SFR */
/* Bitname _DCMPED cannot be defined because it is used by more than one SFR */
/* Bitname _DCMPGIEN cannot be defined because it is used by more than one SFR */
/* Bitname _DCMPEN cannot be defined because it is used by more than one SFR */
/* Bitname _AINID cannot be defined because it is used by more than one SFR */
/* Bitname _AINID0 cannot be defined because it is used by more than one SFR */
/* Bitname _AINID1 cannot be defined because it is used by more than one SFR */
/* Bitname _AINID2 cannot be defined because it is used by more than one SFR */
/* Bitname _AINID3 cannot be defined because it is used by more than one SFR */
/* Bitname _AINID4 cannot be defined because it is used by more than one SFR */

