Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS504.h
#define _ADSTATL_AN12RDY_POSITION                0x0000000C
#define _ADSTATL_AN12RDY_MASK                    0x00001000
#define _ADSTATL_AN12RDY_LENGTH                  0x00000001

#define _ADSTATL_AN14RDY_POSITION                0x0000000E
#define _ADSTATL_AN14RDY_MASK                    0x00004000
#define _ADSTATL_AN14RDY_LENGTH                  0x00000001

#define _ADSTATH_AN17RDY_POSITION                0x00000001
#define _ADSTATH_AN17RDY_MASK                    0x00000002
#define _ADSTATH_AN17RDY_LENGTH                  0x00000001

#define _ADSTATH_AN18RDY_POSITION                0x00000002
#define _ADSTATH_AN18RDY_MASK                    0x00000004
#define _ADSTATH_AN18RDY_LENGTH                  0x00000001

#define _ADSTATH_AN19RDY_POSITION                0x00000003
#define _ADSTATH_AN19RDY_MASK                    0x00000008
#define _ADSTATH_AN19RDY_LENGTH                  0x00000001

#define _ADSTATH_AN20RDY_POSITION                0x00000004
#define _ADSTATH_AN20RDY_MASK                    0x00000010
#define _ADSTATH_AN20RDY_LENGTH                  0x00000001

#define _ADSTATH_AN21RDY_POSITION                0x00000005
#define _ADSTATH_AN21RDY_MASK                    0x00000020
#define _ADSTATH_AN21RDY_LENGTH                  0x00000001

#define _ADSTATH_AN22RDY_POSITION                0x00000006
#define _ADSTATH_AN22RDY_MASK                    0x00000040
#define _ADSTATH_AN22RDY_LENGTH                  0x00000001

#define _ADSTATH_AN23RDY_POSITION                0x00000007
#define _ADSTATH_AN23RDY_MASK                    0x00000080
#define _ADSTATH_AN23RDY_LENGTH                  0x00000001

#define _ADSTATH_AN24RDY_POSITION                0x00000008
#define _ADSTATH_AN24RDY_MASK                    0x00000100
#define _ADSTATH_AN24RDY_LENGTH                  0x00000001

#define _ADSTATH_AN25RDY_POSITION                0x00000009
#define _ADSTATH_AN25RDY_MASK                    0x00000200
#define _ADSTATH_AN25RDY_LENGTH                  0x00000001

#define _ADSTATH_AN26RDY_POSITION                0x0000000A
#define _ADSTATH_AN26RDY_MASK                    0x00000400
#define _ADSTATH_AN26RDY_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN0_POSITION                0x00000000
#define _DCMP1ENL_CMPEN0_MASK                    0x00000001
#define _DCMP1ENL_CMPEN0_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN1_POSITION                0x00000001
#define _DCMP1ENL_CMPEN1_MASK                    0x00000002
#define _DCMP1ENL_CMPEN1_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN2_POSITION                0x00000002
#define _DCMP1ENL_CMPEN2_MASK                    0x00000004
#define _DCMP1ENL_CMPEN2_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN3_POSITION                0x00000003
#define _DCMP1ENL_CMPEN3_MASK                    0x00000008
#define _DCMP1ENL_CMPEN3_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN4_POSITION                0x00000004
#define _DCMP1ENL_CMPEN4_MASK                    0x00000010
#define _DCMP1ENL_CMPEN4_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN5_POSITION                0x00000005
#define _DCMP1ENL_CMPEN5_MASK                    0x00000020
#define _DCMP1ENL_CMPEN5_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN6_POSITION                0x00000006
#define _DCMP1ENL_CMPEN6_MASK                    0x00000040
#define _DCMP1ENL_CMPEN6_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN7_POSITION                0x00000007
#define _DCMP1ENL_CMPEN7_MASK                    0x00000080
#define _DCMP1ENL_CMPEN7_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN8_POSITION                0x00000008
#define _DCMP1ENL_CMPEN8_MASK                    0x00000100
#define _DCMP1ENL_CMPEN8_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN9_POSITION                0x00000009
#define _DCMP1ENL_CMPEN9_MASK                    0x00000200
#define _DCMP1ENL_CMPEN9_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN10_POSITION               0x0000000A
#define _DCMP1ENL_CMPEN10_MASK                   0x00000400
#define _DCMP1ENL_CMPEN10_LENGTH                 0x00000001

#define _DCMP1ENL_CMPEN11_POSITION               0x0000000B
#define _DCMP1ENL_CMPEN11_MASK                   0x00000800
#define _DCMP1ENL_CMPEN11_LENGTH                 0x00000001

#define _DCMP1ENL_CMPEN12_POSITION               0x0000000C
#define _DCMP1ENL_CMPEN12_MASK                   0x00001000
#define _DCMP1ENL_CMPEN12_LENGTH                 0x00000001

#define _DCMP1ENL_CMPEN14_POSITION               0x0000000E
#define _DCMP1ENL_CMPEN14_MASK                   0x00004000
#define _DCMP1ENL_CMPEN14_LENGTH                 0x00000001

#define _DCMP1ENH_CMPEN17_POSITION               0x00000001
#define _DCMP1ENH_CMPEN17_MASK                   0x00000002
#define _DCMP1ENH_CMPEN17_LENGTH                 0x00000001

#define _DCMP1ENH_CMPEN18_POSITION               0x00000002
#define _DCMP1ENH_CMPEN18_MASK                   0x00000004
#define _DCMP1ENH_CMPEN18_LENGTH                 0x00000001

#define _DCMP1ENH_CMPEN19_POSITION               0x00000003
#define _DCMP1ENH_CMPEN19_MASK                   0x00000008
#define _DCMP1ENH_CMPEN19_LENGTH                 0x00000001

#define _DCMP1ENH_CMPEN20_POSITION               0x00000004
#define _DCMP1ENH_CMPEN20_MASK                   0x00000010
#define _DCMP1ENH_CMPEN20_LENGTH                 0x00000001

#define _DCMP1ENH_CMPEN21_POSITION               0x00000005
#define _DCMP1ENH_CMPEN21_MASK                   0x00000020
#define _DCMP1ENH_CMPEN21_LENGTH                 0x00000001

#define _DCMP1ENH_CMPEN22_POSITION               0x00000006
#define _DCMP1ENH_CMPEN22_MASK                   0x00000040
#define _DCMP1ENH_CMPEN22_LENGTH                 0x00000001

#define _DCMP1ENH_CMPEN23_POSITION               0x00000007
#define _DCMP1ENH_CMPEN23_MASK                   0x00000080
#define _DCMP1ENH_CMPEN23_LENGTH                 0x00000001

#define _DCMP1ENH_CMPEN24_POSITION               0x00000008
#define _DCMP1ENH_CMPEN24_MASK                   0x00000100
#define _DCMP1ENH_CMPEN24_LENGTH                 0x00000001

#define _DCMP1ENH_CMPEN25_POSITION               0x00000009
#define _DCMP1ENH_CMPEN25_MASK                   0x00000200
#define _DCMP1ENH_CMPEN25_LENGTH                 0x00000001

#define _DCMP1ENH_CMPEN26_POSITION               0x0000000A
#define _DCMP1ENH_CMPEN26_MASK                   0x00000400
#define _DCMP1ENH_CMPEN26_LENGTH                 0x00000001

