Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS504.h
#define _ADTRIG5_TRGSRC91_POSITION               0x00000009
#define _ADTRIG5_TRGSRC91_MASK                   0x00000200
#define _ADTRIG5_TRGSRC91_LENGTH                 0x00000001

#define _ADTRIG5_TRGSRC92_POSITION               0x0000000A
#define _ADTRIG5_TRGSRC92_MASK                   0x00000400
#define _ADTRIG5_TRGSRC92_LENGTH                 0x00000001

#define _ADTRIG5_TRIGSRC93_POSITION              0x0000000B
#define _ADTRIG5_TRIGSRC93_MASK                  0x00000800
#define _ADTRIG5_TRIGSRC93_LENGTH                0x00000001

#define _ADTRIG5_TRGSRC94_POSITION               0x0000000C
#define _ADTRIG5_TRGSRC94_MASK                   0x00001000
#define _ADTRIG5_TRGSRC94_LENGTH                 0x00000001

#define _ADTRIG6_TRGSRC10_POSITION               0x00000000
#define _ADTRIG6_TRGSRC10_MASK                   0x0000001F
#define _ADTRIG6_TRGSRC10_LENGTH                 0x00000005

#define _ADTRIG6_TRGSRC11_POSITION               0x00000008
#define _ADTRIG6_TRGSRC11_MASK                   0x00001F00
#define _ADTRIG6_TRGSRC11_LENGTH                 0x00000005

#define _ADTRIG6_TRGSRC100_POSITION              0x00000000
#define _ADTRIG6_TRGSRC100_MASK                  0x00000001
#define _ADTRIG6_TRGSRC100_LENGTH                0x00000001

#define _ADTRIG6_TRGSRC101_POSITION              0x00000001
#define _ADTRIG6_TRGSRC101_MASK                  0x00000002
#define _ADTRIG6_TRGSRC101_LENGTH                0x00000001

#define _ADTRIG6_TRGSRC102_POSITION              0x00000002
#define _ADTRIG6_TRGSRC102_MASK                  0x00000004
#define _ADTRIG6_TRGSRC102_LENGTH                0x00000001

#define _ADTRIG6_TRGSRC103_POSITION              0x00000003
#define _ADTRIG6_TRGSRC103_MASK                  0x00000008
#define _ADTRIG6_TRGSRC103_LENGTH                0x00000001

#define _ADTRIG6_TRGSRC104_POSITION              0x00000004
#define _ADTRIG6_TRGSRC104_MASK                  0x00000010
#define _ADTRIG6_TRGSRC104_LENGTH                0x00000001

#define _ADTRIG6_TRGSRC110_POSITION              0x00000008
#define _ADTRIG6_TRGSRC110_MASK                  0x00000100
#define _ADTRIG6_TRGSRC110_LENGTH                0x00000001

#define _ADTRIG6_TRGSRC111_POSITION              0x00000009
#define _ADTRIG6_TRGSRC111_MASK                  0x00000200
#define _ADTRIG6_TRGSRC111_LENGTH                0x00000001

#define _ADTRIG6_TRGSRC112_POSITION              0x0000000A
#define _ADTRIG6_TRGSRC112_MASK                  0x00000400
#define _ADTRIG6_TRGSRC112_LENGTH                0x00000001

#define _ADTRIG6_TRGSRC113_POSITION              0x0000000B
#define _ADTRIG6_TRGSRC113_MASK                  0x00000800
#define _ADTRIG6_TRGSRC113_LENGTH                0x00000001

#define _ADTRIG6_TRGSRC114_POSITION              0x0000000C
#define _ADTRIG6_TRGSRC114_MASK                  0x00001000
#define _ADTRIG6_TRGSRC114_LENGTH                0x00000001

#define _ADTRIG7_TRGSRC12_POSITION               0x00000000
#define _ADTRIG7_TRGSRC12_MASK                   0x0000001F
#define _ADTRIG7_TRGSRC12_LENGTH                 0x00000005

#define _ADTRIG7_TRGSRC120_POSITION              0x00000000
#define _ADTRIG7_TRGSRC120_MASK                  0x00000001
#define _ADTRIG7_TRGSRC120_LENGTH                0x00000001

#define _ADTRIG7_TRGSRC121_POSITION              0x00000001
#define _ADTRIG7_TRGSRC121_MASK                  0x00000002
#define _ADTRIG7_TRGSRC121_LENGTH                0x00000001

#define _ADTRIG7_TRGSRC122_POSITION              0x00000002
#define _ADTRIG7_TRGSRC122_MASK                  0x00000004
#define _ADTRIG7_TRGSRC122_LENGTH                0x00000001

#define _ADTRIG7_TRGSRC123_POSITION              0x00000003
#define _ADTRIG7_TRGSRC123_MASK                  0x00000008
#define _ADTRIG7_TRGSRC123_LENGTH                0x00000001

#define _ADTRIG7_TRGSRC124_POSITION              0x00000004
#define _ADTRIG7_TRGSRC124_MASK                  0x00000010
#define _ADTRIG7_TRGSRC124_LENGTH                0x00000001

#define _ADTRIG8_TRGSRC14_POSITION               0x00000000
#define _ADTRIG8_TRGSRC14_MASK                   0x0000001F
#define _ADTRIG8_TRGSRC14_LENGTH                 0x00000005

#define _ADTRIG8_TRGSRC140_POSITION              0x00000000
#define _ADTRIG8_TRGSRC140_MASK                  0x00000001
#define _ADTRIG8_TRGSRC140_LENGTH                0x00000001

#define _ADTRIG8_TRGSRC141_POSITION              0x00000001
#define _ADTRIG8_TRGSRC141_MASK                  0x00000002
#define _ADTRIG8_TRGSRC141_LENGTH                0x00000001

#define _ADTRIG8_TRGSRC142_POSITION              0x00000002
#define _ADTRIG8_TRGSRC142_MASK                  0x00000004
#define _ADTRIG8_TRGSRC142_LENGTH                0x00000001

#define _ADTRIG8_TRGSRC143_POSITION              0x00000003
#define _ADTRIG8_TRGSRC143_MASK                  0x00000008
#define _ADTRIG8_TRGSRC143_LENGTH                0x00000001

#define _ADTRIG8_TRGSRC144_POSITION              0x00000004
#define _ADTRIG8_TRGSRC144_MASK                  0x00000010
#define _ADTRIG8_TRGSRC144_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC17_POSITION               0x00000008
#define _ADTRIG9_TRGSRC17_MASK                   0x00001F00
#define _ADTRIG9_TRGSRC17_LENGTH                 0x00000005

#define _ADTRIG9_TRGSRC170_POSITION              0x00000008
#define _ADTRIG9_TRGSRC170_MASK                  0x00000100
#define _ADTRIG9_TRGSRC170_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC171_POSITION              0x00000009
#define _ADTRIG9_TRGSRC171_MASK                  0x00000200
#define _ADTRIG9_TRGSRC171_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC172_POSITION              0x0000000A
#define _ADTRIG9_TRGSRC172_MASK                  0x00000400
#define _ADTRIG9_TRGSRC172_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC173_POSITION              0x0000000B
#define _ADTRIG9_TRGSRC173_MASK                  0x00000800
#define _ADTRIG9_TRGSRC173_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC174_POSITION              0x0000000C
#define _ADTRIG9_TRGSRC174_MASK                  0x00001000
#define _ADTRIG9_TRGSRC174_LENGTH                0x00000001

#define _ADTRIG10_TRGSRC18_POSITION              0x00000000
#define _ADTRIG10_TRGSRC18_MASK                  0x0000001F
#define _ADTRIG10_TRGSRC18_LENGTH                0x00000005

#define _ADTRIG10_TRGSRC19_POSITION              0x00000008
#define _ADTRIG10_TRGSRC19_MASK                  0x00001F00
#define _ADTRIG10_TRGSRC19_LENGTH                0x00000005

#define _ADTRIG10_TRGSRC180_POSITION             0x00000000
#define _ADTRIG10_TRGSRC180_MASK                 0x00000001
#define _ADTRIG10_TRGSRC180_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC181_POSITION             0x00000001
#define _ADTRIG10_TRGSRC181_MASK                 0x00000002
#define _ADTRIG10_TRGSRC181_LENGTH               0x00000001

