Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS504.h
#define _ADTRIG10_TRGSRC182_POSITION             0x00000002
#define _ADTRIG10_TRGSRC182_MASK                 0x00000004
#define _ADTRIG10_TRGSRC182_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC183_POSITION             0x00000003
#define _ADTRIG10_TRGSRC183_MASK                 0x00000008
#define _ADTRIG10_TRGSRC183_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC184_POSITION             0x00000004
#define _ADTRIG10_TRGSRC184_MASK                 0x00000010
#define _ADTRIG10_TRGSRC184_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC190_POSITION             0x00000008
#define _ADTRIG10_TRGSRC190_MASK                 0x00000100
#define _ADTRIG10_TRGSRC190_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC191_POSITION             0x00000009
#define _ADTRIG10_TRGSRC191_MASK                 0x00000200
#define _ADTRIG10_TRGSRC191_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC192_POSITION             0x0000000A
#define _ADTRIG10_TRGSRC192_MASK                 0x00000400
#define _ADTRIG10_TRGSRC192_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC193_POSITION             0x0000000B
#define _ADTRIG10_TRGSRC193_MASK                 0x00000800
#define _ADTRIG10_TRGSRC193_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC194_POSITION             0x0000000C
#define _ADTRIG10_TRGSRC194_MASK                 0x00001000
#define _ADTRIG10_TRGSRC194_LENGTH               0x00000001

#define _ADTRIG11_TRGSRC20_POSITION              0x00000000
#define _ADTRIG11_TRGSRC20_MASK                  0x0000001F
#define _ADTRIG11_TRGSRC20_LENGTH                0x00000005

#define _ADTRIG11_TRGSRC21_POSITION              0x00000008
#define _ADTRIG11_TRGSRC21_MASK                  0x00001F00
#define _ADTRIG11_TRGSRC21_LENGTH                0x00000005

#define _ADTRIG11_TRGSRC200_POSITION             0x00000000
#define _ADTRIG11_TRGSRC200_MASK                 0x00000001
#define _ADTRIG11_TRGSRC200_LENGTH               0x00000001

#define _ADTRIG11_TRGSRC201_POSITION             0x00000001
#define _ADTRIG11_TRGSRC201_MASK                 0x00000002
#define _ADTRIG11_TRGSRC201_LENGTH               0x00000001

#define _ADTRIG11_TRGSRC202_POSITION             0x00000002
#define _ADTRIG11_TRGSRC202_MASK                 0x00000004
#define _ADTRIG11_TRGSRC202_LENGTH               0x00000001

#define _ADTRIG11_TRGSRC203_POSITION             0x00000003
#define _ADTRIG11_TRGSRC203_MASK                 0x00000008
#define _ADTRIG11_TRGSRC203_LENGTH               0x00000001

#define _ADTRIG11_TRGSRC204_POSITION             0x00000004
#define _ADTRIG11_TRGSRC204_MASK                 0x00000010
#define _ADTRIG11_TRGSRC204_LENGTH               0x00000001

#define _ADTRIG11_TRGSRC210_POSITION             0x00000008
#define _ADTRIG11_TRGSRC210_MASK                 0x00000100
#define _ADTRIG11_TRGSRC210_LENGTH               0x00000001

#define _ADTRIG11_TRGSRC211_POSITION             0x00000009
#define _ADTRIG11_TRGSRC211_MASK                 0x00000200
#define _ADTRIG11_TRGSRC211_LENGTH               0x00000001

#define _ADTRIG11_TRGSRC212_POSITION             0x0000000A
#define _ADTRIG11_TRGSRC212_MASK                 0x00000400
#define _ADTRIG11_TRGSRC212_LENGTH               0x00000001

#define _ADTRIG11_TRGSRC213_POSITION             0x0000000B
#define _ADTRIG11_TRGSRC213_MASK                 0x00000800
#define _ADTRIG11_TRGSRC213_LENGTH               0x00000001

#define _ADTRIG11_TRGSRC214_POSITION             0x0000000C
#define _ADTRIG11_TRGSRC214_MASK                 0x00001000
#define _ADTRIG11_TRGSRC214_LENGTH               0x00000001

#define _ADTRIG12_TRGSRC22_POSITION              0x00000000
#define _ADTRIG12_TRGSRC22_MASK                  0x0000001F
#define _ADTRIG12_TRGSRC22_LENGTH                0x00000005

#define _ADTRIG12_TRGSRC23_POSITION              0x00000008
#define _ADTRIG12_TRGSRC23_MASK                  0x00001F00
#define _ADTRIG12_TRGSRC23_LENGTH                0x00000005

#define _ADTRIG12_TRGSRC220_POSITION             0x00000000
#define _ADTRIG12_TRGSRC220_MASK                 0x00000001
#define _ADTRIG12_TRGSRC220_LENGTH               0x00000001

#define _ADTRIG12_TRGSRC221_POSITION             0x00000001
#define _ADTRIG12_TRGSRC221_MASK                 0x00000002
#define _ADTRIG12_TRGSRC221_LENGTH               0x00000001

#define _ADTRIG12_TRGSRC222_POSITION             0x00000002
#define _ADTRIG12_TRGSRC222_MASK                 0x00000004
#define _ADTRIG12_TRGSRC222_LENGTH               0x00000001

#define _ADTRIG12_TRGSRC223_POSITION             0x00000003
#define _ADTRIG12_TRGSRC223_MASK                 0x00000008
#define _ADTRIG12_TRGSRC223_LENGTH               0x00000001

#define _ADTRIG12_TRGSRC224_POSITION             0x00000004
#define _ADTRIG12_TRGSRC224_MASK                 0x00000010
#define _ADTRIG12_TRGSRC224_LENGTH               0x00000001

#define _ADTRIG12_TRGSRC230_POSITION             0x00000008
#define _ADTRIG12_TRGSRC230_MASK                 0x00000100
#define _ADTRIG12_TRGSRC230_LENGTH               0x00000001

#define _ADTRIG12_TRGSRC231_POSITION             0x00000009
#define _ADTRIG12_TRGSRC231_MASK                 0x00000200
#define _ADTRIG12_TRGSRC231_LENGTH               0x00000001

#define _ADTRIG12_TRGSRC232_POSITION             0x0000000A
#define _ADTRIG12_TRGSRC232_MASK                 0x00000400
#define _ADTRIG12_TRGSRC232_LENGTH               0x00000001

#define _ADTRIG12_TRGSRC233_POSITION             0x0000000B
#define _ADTRIG12_TRGSRC233_MASK                 0x00000800
#define _ADTRIG12_TRGSRC233_LENGTH               0x00000001

#define _ADTRIG12_TRGSRC234_POSITION             0x0000000C
#define _ADTRIG12_TRGSRC234_MASK                 0x00001000
#define _ADTRIG12_TRGSRC234_LENGTH               0x00000001

#define _ADTRIG13_TRGSRC24_POSITION              0x00000000
#define _ADTRIG13_TRGSRC24_MASK                  0x0000001F
#define _ADTRIG13_TRGSRC24_LENGTH                0x00000005

#define _ADTRIG13_TRGSRC25_POSITION              0x00000008
#define _ADTRIG13_TRGSRC25_MASK                  0x00001F00
#define _ADTRIG13_TRGSRC25_LENGTH                0x00000005

#define _ADTRIG13_TRGSRC240_POSITION             0x00000000
#define _ADTRIG13_TRGSRC240_MASK                 0x00000001
#define _ADTRIG13_TRGSRC240_LENGTH               0x00000001

#define _ADTRIG13_TRGSRC241_POSITION             0x00000001
#define _ADTRIG13_TRGSRC241_MASK                 0x00000002
#define _ADTRIG13_TRGSRC241_LENGTH               0x00000001

#define _ADTRIG13_TRGSRC242_POSITION             0x00000002
#define _ADTRIG13_TRGSRC242_MASK                 0x00000004
#define _ADTRIG13_TRGSRC242_LENGTH               0x00000001

