Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS504.h
#define _ADTRIG13_TRGSRC243_POSITION             0x00000003
#define _ADTRIG13_TRGSRC243_MASK                 0x00000008
#define _ADTRIG13_TRGSRC243_LENGTH               0x00000001

#define _ADTRIG13_TRGSRC244_POSITION             0x00000004
#define _ADTRIG13_TRGSRC244_MASK                 0x00000010
#define _ADTRIG13_TRGSRC244_LENGTH               0x00000001

#define _ADTRIG13_TRGSRC250_POSITION             0x00000008
#define _ADTRIG13_TRGSRC250_MASK                 0x00000100
#define _ADTRIG13_TRGSRC250_LENGTH               0x00000001

#define _ADTRIG13_TRGSRC251_POSITION             0x00000009
#define _ADTRIG13_TRGSRC251_MASK                 0x00000200
#define _ADTRIG13_TRGSRC251_LENGTH               0x00000001

#define _ADTRIG13_TRGSRC252_POSITION             0x0000000A
#define _ADTRIG13_TRGSRC252_MASK                 0x00000400
#define _ADTRIG13_TRGSRC252_LENGTH               0x00000001

#define _ADTRIG13_TRGSRC253_POSITION             0x0000000B
#define _ADTRIG13_TRGSRC253_MASK                 0x00000800
#define _ADTRIG13_TRGSRC253_LENGTH               0x00000001

#define _ADTRIG13_TRGSRC254_POSITION             0x0000000C
#define _ADTRIG13_TRGSRC254_MASK                 0x00001000
#define _ADTRIG13_TRGSRC254_LENGTH               0x00000001

#define _ADTRIG14_TRGSRC26_POSITION              0x00000000
#define _ADTRIG14_TRGSRC26_MASK                  0x0000001F
#define _ADTRIG14_TRGSRC26_LENGTH                0x00000005

#define _ADTRIG14_TRGSRC260_POSITION             0x00000000
#define _ADTRIG14_TRGSRC260_MASK                 0x00000001
#define _ADTRIG14_TRGSRC260_LENGTH               0x00000001

#define _ADTRIG14_TRGSRC261_POSITION             0x00000001
#define _ADTRIG14_TRGSRC261_MASK                 0x00000002
#define _ADTRIG14_TRGSRC261_LENGTH               0x00000001

#define _ADTRIG14_TRGSRC262_POSITION             0x00000002
#define _ADTRIG14_TRGSRC262_MASK                 0x00000004
#define _ADTRIG14_TRGSRC262_LENGTH               0x00000001

#define _ADTRIG14_TRGSRC263_POSITION             0x00000003
#define _ADTRIG14_TRGSRC263_MASK                 0x00000008
#define _ADTRIG14_TRGSRC263_LENGTH               0x00000001

#define _ADTRIG14_TRGSRC264_POSITION             0x00000004
#define _ADTRIG14_TRGSRC264_MASK                 0x00000010
#define _ADTRIG14_TRGSRC264_LENGTH               0x00000001

#define _DCMP1CON_IELOLO_POSITION                0x00000000
#define _DCMP1CON_IELOLO_MASK                    0x00000001
#define _DCMP1CON_IELOLO_LENGTH                  0x00000001

#define _DCMP1CON_IELOHI_POSITION                0x00000001
#define _DCMP1CON_IELOHI_MASK                    0x00000002
#define _DCMP1CON_IELOHI_LENGTH                  0x00000001

#define _DCMP1CON_IEHILO_POSITION                0x00000002
#define _DCMP1CON_IEHILO_MASK                    0x00000004
#define _DCMP1CON_IEHILO_LENGTH                  0x00000001

#define _DCMP1CON_IEHIHI_POSITION                0x00000003
#define _DCMP1CON_IEHIHI_MASK                    0x00000008
#define _DCMP1CON_IEHIHI_LENGTH                  0x00000001

#define _DCMP1CON_IEBTWN_POSITION                0x00000004
#define _DCMP1CON_IEBTWN_MASK                    0x00000010
#define _DCMP1CON_IEBTWN_LENGTH                  0x00000001

#define _DCMP1CON_DCMPED_POSITION                0x00000005
#define _DCMP1CON_DCMPED_MASK                    0x00000020
#define _DCMP1CON_DCMPED_LENGTH                  0x00000001

#define _DCMP1CON_DCMPGIEN_POSITION              0x00000006
#define _DCMP1CON_DCMPGIEN_MASK                  0x00000040
#define _DCMP1CON_DCMPGIEN_LENGTH                0x00000001

#define _DCMP1CON_DCMPEN_POSITION                0x00000007
#define _DCMP1CON_DCMPEN_MASK                    0x00000080
#define _DCMP1CON_DCMPEN_LENGTH                  0x00000001

#define _DCMP1CON_AINID_POSITION                 0x00000008
#define _DCMP1CON_AINID_MASK                     0x00001F00
#define _DCMP1CON_AINID_LENGTH                   0x00000005

#define _DCMP1CON_AINID0_POSITION                0x00000008
#define _DCMP1CON_AINID0_MASK                    0x00000100
#define _DCMP1CON_AINID0_LENGTH                  0x00000001

#define _DCMP1CON_AINID1_POSITION                0x00000009
#define _DCMP1CON_AINID1_MASK                    0x00000200
#define _DCMP1CON_AINID1_LENGTH                  0x00000001

#define _DCMP1CON_AINID2_POSITION                0x0000000A
#define _DCMP1CON_AINID2_MASK                    0x00000400
#define _DCMP1CON_AINID2_LENGTH                  0x00000001

#define _DCMP1CON_AINID3_POSITION                0x0000000B
#define _DCMP1CON_AINID3_MASK                    0x00000800
#define _DCMP1CON_AINID3_LENGTH                  0x00000001

#define _DCMP1CON_AINID4_POSITION                0x0000000C
#define _DCMP1CON_AINID4_MASK                    0x00001000
#define _DCMP1CON_AINID4_LENGTH                  0x00000001

#define _DCMP2CON_IELOLO_POSITION                0x00000000
#define _DCMP2CON_IELOLO_MASK                    0x00000001
#define _DCMP2CON_IELOLO_LENGTH                  0x00000001

#define _DCMP2CON_IELOHI_POSITION                0x00000001
#define _DCMP2CON_IELOHI_MASK                    0x00000002
#define _DCMP2CON_IELOHI_LENGTH                  0x00000001

#define _DCMP2CON_IEHILO_POSITION                0x00000002
#define _DCMP2CON_IEHILO_MASK                    0x00000004
#define _DCMP2CON_IEHILO_LENGTH                  0x00000001

#define _DCMP2CON_IEHIHI_POSITION                0x00000003
#define _DCMP2CON_IEHIHI_MASK                    0x00000008
#define _DCMP2CON_IEHIHI_LENGTH                  0x00000001

#define _DCMP2CON_IEBTWN_POSITION                0x00000004
#define _DCMP2CON_IEBTWN_MASK                    0x00000010
#define _DCMP2CON_IEBTWN_LENGTH                  0x00000001

#define _DCMP2CON_DCMPED_POSITION                0x00000005
#define _DCMP2CON_DCMPED_MASK                    0x00000020
#define _DCMP2CON_DCMPED_LENGTH                  0x00000001

#define _DCMP2CON_DCMPGIEN_POSITION              0x00000006
#define _DCMP2CON_DCMPGIEN_MASK                  0x00000040
#define _DCMP2CON_DCMPGIEN_LENGTH                0x00000001

