Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS504.h
#define _RPOR11_RP54R2_POSITION                  0x00000002
#define _RPOR11_RP54R2_MASK                      0x00000004
#define _RPOR11_RP54R2_LENGTH                    0x00000001

#define _RPOR11_RP54R3_POSITION                  0x00000003
#define _RPOR11_RP54R3_MASK                      0x00000008
#define _RPOR11_RP54R3_LENGTH                    0x00000001

#define _RPOR11_RP54R4_POSITION                  0x00000004
#define _RPOR11_RP54R4_MASK                      0x00000010
#define _RPOR11_RP54R4_LENGTH                    0x00000001

#define _RPOR11_RP54R5_POSITION                  0x00000005
#define _RPOR11_RP54R5_MASK                      0x00000020
#define _RPOR11_RP54R5_LENGTH                    0x00000001

#define _RPOR11_RP55R0_POSITION                  0x00000008
#define _RPOR11_RP55R0_MASK                      0x00000100
#define _RPOR11_RP55R0_LENGTH                    0x00000001

#define _RPOR11_RP55R1_POSITION                  0x00000009
#define _RPOR11_RP55R1_MASK                      0x00000200
#define _RPOR11_RP55R1_LENGTH                    0x00000001

#define _RPOR11_RP55R2_POSITION                  0x0000000A
#define _RPOR11_RP55R2_MASK                      0x00000400
#define _RPOR11_RP55R2_LENGTH                    0x00000001

#define _RPOR11_RP55R3_POSITION                  0x0000000B
#define _RPOR11_RP55R3_MASK                      0x00000800
#define _RPOR11_RP55R3_LENGTH                    0x00000001

#define _RPOR11_RP55R4_POSITION                  0x0000000C
#define _RPOR11_RP55R4_MASK                      0x00001000
#define _RPOR11_RP55R4_LENGTH                    0x00000001

#define _RPOR11_RP55R5_POSITION                  0x0000000D
#define _RPOR11_RP55R5_MASK                      0x00002000
#define _RPOR11_RP55R5_LENGTH                    0x00000001

#define _RPOR12_RP56R_POSITION                   0x00000000
#define _RPOR12_RP56R_MASK                       0x0000003F
#define _RPOR12_RP56R_LENGTH                     0x00000006

#define _RPOR12_RP57R_POSITION                   0x00000008
#define _RPOR12_RP57R_MASK                       0x00003F00
#define _RPOR12_RP57R_LENGTH                     0x00000006

#define _RPOR12_RP56R0_POSITION                  0x00000000
#define _RPOR12_RP56R0_MASK                      0x00000001
#define _RPOR12_RP56R0_LENGTH                    0x00000001

#define _RPOR12_RP56R1_POSITION                  0x00000001
#define _RPOR12_RP56R1_MASK                      0x00000002
#define _RPOR12_RP56R1_LENGTH                    0x00000001

#define _RPOR12_RP56R2_POSITION                  0x00000002
#define _RPOR12_RP56R2_MASK                      0x00000004
#define _RPOR12_RP56R2_LENGTH                    0x00000001

#define _RPOR12_RP56R3_POSITION                  0x00000003
#define _RPOR12_RP56R3_MASK                      0x00000008
#define _RPOR12_RP56R3_LENGTH                    0x00000001

#define _RPOR12_RP56R4_POSITION                  0x00000004
#define _RPOR12_RP56R4_MASK                      0x00000010
#define _RPOR12_RP56R4_LENGTH                    0x00000001

#define _RPOR12_RP56R5_POSITION                  0x00000005
#define _RPOR12_RP56R5_MASK                      0x00000020
#define _RPOR12_RP56R5_LENGTH                    0x00000001

#define _RPOR12_RP57R0_POSITION                  0x00000008
#define _RPOR12_RP57R0_MASK                      0x00000100
#define _RPOR12_RP57R0_LENGTH                    0x00000001

#define _RPOR12_RP57R1_POSITION                  0x00000009
#define _RPOR12_RP57R1_MASK                      0x00000200
#define _RPOR12_RP57R1_LENGTH                    0x00000001

#define _RPOR12_RP57R2_POSITION                  0x0000000A
#define _RPOR12_RP57R2_MASK                      0x00000400
#define _RPOR12_RP57R2_LENGTH                    0x00000001

#define _RPOR12_RP57R3_POSITION                  0x0000000B
#define _RPOR12_RP57R3_MASK                      0x00000800
#define _RPOR12_RP57R3_LENGTH                    0x00000001

#define _RPOR12_RP57R4_POSITION                  0x0000000C
#define _RPOR12_RP57R4_MASK                      0x00001000
#define _RPOR12_RP57R4_LENGTH                    0x00000001

#define _RPOR12_RP57R5_POSITION                  0x0000000D
#define _RPOR12_RP57R5_MASK                      0x00002000
#define _RPOR12_RP57R5_LENGTH                    0x00000001

#define _RPOR13_RP58R_POSITION                   0x00000000
#define _RPOR13_RP58R_MASK                       0x0000003F
#define _RPOR13_RP58R_LENGTH                     0x00000006

#define _RPOR13_RP59R_POSITION                   0x00000008
#define _RPOR13_RP59R_MASK                       0x00003F00
#define _RPOR13_RP59R_LENGTH                     0x00000006

#define _RPOR13_RP58R0_POSITION                  0x00000000
#define _RPOR13_RP58R0_MASK                      0x00000001
#define _RPOR13_RP58R0_LENGTH                    0x00000001

#define _RPOR13_RP58R1_POSITION                  0x00000001
#define _RPOR13_RP58R1_MASK                      0x00000002
#define _RPOR13_RP58R1_LENGTH                    0x00000001

#define _RPOR13_RP58R2_POSITION                  0x00000002
#define _RPOR13_RP58R2_MASK                      0x00000004
#define _RPOR13_RP58R2_LENGTH                    0x00000001

#define _RPOR13_RP58R3_POSITION                  0x00000003
#define _RPOR13_RP58R3_MASK                      0x00000008
#define _RPOR13_RP58R3_LENGTH                    0x00000001

#define _RPOR13_RP58R4_POSITION                  0x00000004
#define _RPOR13_RP58R4_MASK                      0x00000010
#define _RPOR13_RP58R4_LENGTH                    0x00000001

#define _RPOR13_RP58R5_POSITION                  0x00000005
#define _RPOR13_RP58R5_MASK                      0x00000020
#define _RPOR13_RP58R5_LENGTH                    0x00000001

#define _RPOR13_RP59R0_POSITION                  0x00000008
#define _RPOR13_RP59R0_MASK                      0x00000100
#define _RPOR13_RP59R0_LENGTH                    0x00000001

#define _RPOR13_RP59R1_POSITION                  0x00000009
#define _RPOR13_RP59R1_MASK                      0x00000200
#define _RPOR13_RP59R1_LENGTH                    0x00000001

